import math


def area(r):
    return math.pi * r * r
'''
Функция нахождения площади окружности, принимает радиус окружности, возвращает значение площади
    Параметры:
        r (int): радиус окружности, целое число
    Возвращаемое значение:
        math.pi * r * r: площадь окружности, вещественное число
        
'''

def perimeter(r):
    return 2 * math.pi * r
'''
Функция нахождения периметра окружности, принимает радиус окружности, возвращает значение периметра
    Параметры:
        r (int): радиус окружности, целое число
    Возвращаемое значение:
        2 * math.pi * r: периметр окружности, вещественное число
'''
