def area(a, b): 
    """Принимает два ребра прамоугольника и возвращает его площадь.

            Параметры:
                a, b (float, int): длинны ребер

            Возвращаемое значение:
                area (float, int): площадь прамоугольника со сторонами a, b
    """
    return a * b 

def perimeter(a, b): 
    """Принимает два ребра прамоугольника и возвращает его периметр.

            Параметры:
                a, b (float, int): длинны ребер

            Возвращаемое значение:
                perimeter (float, int): периметр прамоугольника со сторонами a, b
    """
    return (a + b) * 2 

