def area(a, b):
    '''
    На вход поступает два числа:
                a (int): длина одной стороны
                b (int): длина другой стороны
        Функция возвращает значение равное произведению длины одной стороны на длину другой.
    '''
    return a * b
def perimetr(a, b):
    '''
    На вход поступает 2 числа:
                a (int): длина одной стороны
                b (int): длина другой стороны
        Функция возвращает значение равное удвоенному произведению длины одной стороны на длину другой.
    '''
    return (a + b) * 2
