def area(a, b):
	'''Принимает два числа a и b (стороны прямоугольника), возвращает площадь прямоугольника с такими сторонами.
		
		Параметры:
			a (int): десятичное целое число
			b (int): десятичное целое число
		
		Возвращаемое значение:
			a * b: площадь прямоугольника со сторонами a и b
	'''
    return a * b 

def perimeter(a, b): 
	'''Принимает два числа a и b (стороны прямоугольника), возвращает периметр прямоугольника с такими сторонами.
		
		Параметры:
			a (int): десятичное целое число
			b (int): десятичное целое число
		
		Возвращаемое значение:
			2(a + b): периметр прямоугольника со сторонами a и b
	'''
    return 2(a + b)
