def area(a, b): 
     '''
    Рассчитывает площадь прямоугольника.
            Параметры:
                    a (float): длина прямоугольника.
                    b (float): ширина прямоугольника.

            Возвращаемое значение:
                    a * b (float): площадь прямоугольника.
    '''
    return a * b 

def perimeter(a, b): 
    '''
    Рассчитывает площадь прямоугольника.
           Параметры:
                    a (float): длина прямоугольника.
                    b (float): ширина прямоугольника.

            Возвращаемое значение:
                    2 * (a + b) (float): периметр прямоугольника.
    '''
    return (a + b)*2