def area(a, b):
    '''
    Функция area принимает на вход два параметра a и b (int/float) - длины смежных сторон прямоугольника.
    Возвращает площадь этого прямоугольника (int/float (в зависимости от типа входных данных)).
    '''
    return a * b

def perimeter(a, b):
    '''
    Функция perimeter принимает на вход два параметра a и b (int/float) - длины смежных сторон квадрата.
    Возвращает периметр этого прямоугольника (int/float (в зависимости от типа входных данных)).
    '''
    return 2 * (a + b)