def area(a, b):
    """ Возвращает площадь прямоугольника.
               Параметры:
                    a, b (int) : соседние стороны прямоугольника
               Возвращаемое значение:
                   a*b (int) : значение площади прямоугольника размера axb"""
    return a * b 

def perimeter(a, b):
    """ Возвращает периметр прямоугольника.
                   Параметры:
                        a, b (int) : соседние стороны прямоугольника
                   Возвращаемое значение:
                       2*a + 2*b (int) : значение периметра прямоугольника размера axb"""
    return 2*a + 2*b 