def area(a, b):
    ''' Возвращает произведение двух сторон, как его площадь

                    Параметры:
                        a (int) - длина одной стороны
                        b (int) - длина второй стороны (не равной длине первой)

                    Возвращаемое значение:
                        площадь прямоугольника '''
    return a * b 

def perimeter(a, b):
    ''' возвращает сумму всех сторон пряиоугольника, как его периметр

                    Параметры:
                        a (int) - длина одной стороны
                        b (int) - длина второй стороны (не равной длине первой)

                    Возвращаемое значение:
                        периметр прямоугольлника '''
    return 2 * a + 2 * b 
