def area(a, b): 
    '''Возвращает площадь прямоугольника

        Параметры:
            a (int) or (float):Сторона прямоугольника
            b (int) or (float):Сторона прямоугольника

        Возвращаемое значение:
            (int) or (float):Площадь данного прямоугольника
    ''' 
    return a * b 

def perimeter(a, b):  
    '''Возвращает периметр прямоугольника
    
        Параметры:
            a (int) or (float):Сторона прямоугольника
            b (int) or (float):Сторона прямоугольника

        Возвращаемое значение:
            (int) or (float):Периметр данного прямоугольника
    '''   
    return 2 * (a + b) 
