def area(a, b):
    '''
        Возвращаем площадь прямоугольника по заданным сторонам.

            Параметры:
                a, b (int): Стороны прямоугольника.

            Возвращаемое значение:
                area (int): Площадь прямоугольника.
        '''

    return a * b

def perimeter(a, b):
    '''
        Возвращаем периметр прямоугольника по заданным сторонам.

            Параметры:
                a, b (int): Стороны прямоугольника.

            Возвращаемое значение:
                perimeter (int): Периметр прямоугольника.
        '''

    return (a + b) * 2
