def area(a, b):
    return a * b
    '''
        Возвращает площадь прямоугольника.
            Параметры: 
                a, b (int): Две стороны прямоугольника.

            Возвращаемое значение: 
                (a * b): Площадь прямоугольника.
    '''

def perimeter(a, b):
    return (a + b) * 2
    '''
        Возвращает периметр прямоугольника.
            Параметры: 
                a, b (int): Две стороны прямоугольника.

            Возвращаемое значение: 
                ((a + b) * 2): Периметр прямоугольника.
    '''



