def area(a, b):
    '''
    Возвращает площадь прямоугольника со сторонами a и b.

	Параметры:
		a (int): первая сторона прямоугольника (ширина).
		b (int): вторая сторона прямоугольника (высота).

	Возвращаемое значение:
		area (int): площадь прямоугольника со сторонами a и b.
    '''
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника со сторонами a и b.

    Параметры:
        a (int): первая сторона прямоугольника (ширина).
        b (int): вторая сторона прямоугольника (высота).

    Возвращаемое значение:
        perimeter (int): периметр прямоугольника со сторонами a и b.
    '''
    return 2 * (a + b)
