def area(a, b):
    return a * b
'''
Функция нахождения площади прямоугольника, принимает длину и ширину прямоугольника, возвращает значение площади
    Параметры:
        a (int): длина прямоугольника, целое число
        b (int): ширина прямоугольника, целое число
    Возвращаемое значение:
        a * b: площадь прямоугольника, целое число
'''

def perimeter(a, b):
    return 2 * (a + b)
'''
Функция нахождения периметра прямоугольника, принимает длину и ширину прямоугольника, возвращает значение периметра
    Параметры:
        a (int): длина прямоугольника, целое число
        b (int): ширина прямоугольника, целое число
    Возвращаемое значение:
        2 * (a + b): периметр прямоугольника, целое число
'''