def area(a, b):
    """
    Вычисляет значение площади прямоугольника.
    
    Принимает 2 параметра:
      Параметр a (int) - первая сторона прямоугольника.
      Параметр b (int) - вторая сторона прямоугольника.

    Возвращает int значение площади прямоугольника.
    """
    return a * b 

def perimeter(a, b): 
    """
    Вычисляет значение периметра прямоугольника.
    Принимает 2 параметра:
      Параметр a (int) - первая сторона прямоугольника.
      Параметр b (int) - вторая сторона прямоугольника.

    Возвращает int значение периметра прямоугольника.
    """
    return (a + b) * 2