def area(a, b):
    '''
    Рассчитывает площадь прямоугольника.

            Пример вызова:
                    area(2, 3)  # Возвращает площадь прямоугольника с длиной 2 и шириной 3.

            Параметры:
                    a (float): длина прямоугольника.
                    b (float): ширина прямоугольника.

            Возвращаемое значение:
                    a * b (float): Площадь прямоугольника.
    '''
    return a * b
def perimeter(a, b):
    '''
    Рассчитывает площадь прямоугольника.

            Пример вызова:
                    area(2, 3)  # Возвращает периметр прямоугольника с длиной 2 и шириной 3.

            Параметры:
                    a (float): длина прямоугольника.
                    b (float): ширина прямоугольника.

            Возвращаемое значение:
                    2 * (a + b) (float): Площадь периметр.
    '''
    return 2 * (a + b)
