
def area(a):
    """ Возвращает площадь квадрата.
                   Параметры:
                        a (int) : сторона квадрата
                   Возвращаемое значение:
                       a*a (int) : значение площади квадрата со стороной a"""
    return a * a


def perimeter(a):
    """ Возвращает периметр квадрата.
                       Параметры:
                            a (int) : сторона квадрата
                       Возвращаемое значение:
                           4*a (int) : значение периметра квадрата со стороной a"""
    return 4 * a
