
def area(a):
    '''
    Рассчитывает площадь квадрата.
            Параметры:
                    a (float): длина стороны квадрата.

            Возвращаемое значение:
                    a * a (float): площадь квадрата.
    '''
    return a * a


def perimeter(a):
    '''
    Рассчитывает периметр квадрата.
            Параметры:
                    a (float): длина стороны квадрата.

            Возвращаемое значение:
                    4 * a (float): периметр квадрата.
    '''
    return 4 * a
