
def area(a):

    '''
            Возвращаем площадь квадрата по заданной стороне.

                Параметры:
                    a (int): Сторона квадрата.

                Возвращаемое значение:
                    area (int): Площадь квадрата.
            '''

    return a * a


def perimeter(a):

    '''
                Возвращаем периметр квадрата по заданной стороне.

                    Параметры:
                        a (int): Сторона квадрата.

                    Возвращаемое значение:
                        Perimeter (int): Периметр квадрата.
                '''

    return 4 * a


