def area(a):
    return a * a
'''
Функция нахождения площади квадрата, принимает длину квадрата, возвращает значение площади
    Параметры:
        a (int): длина квадрата, целое число
    Возвращаемое значение:
        a * a: площадь квадрата, целое число
'''

def perimeter(a):
    return 4 * a
'''
Функция нахождения периметра квадрата, принимает длину квадрата, возвращает значение периметра
    Параметры:
        a (int): длина квадарата, целое число
    Возвращаемое значение:
        4 * a: периметр квадарата, целое число
'''
