
def area(side: int) -> int:
    # Данная функция предназначенна для подсчета площади квадрата

    # Функция принимает одно число (int):
    #   side  :  одна из сторон квадрата

    # Возвращает площадь фигуры, а именно side умноженный на side
    #   * Возвращаемое значение area -> int

    # Пример вызова:
    # 1) side = 5 (входные данные)
    # 2) 5 * 5 = 25 (полученние возвращаемого значения функции)

    return side * side


def perimeter(side: int) -> int:
    # Данная функция предназначенна для подсчета площади квадрата

    # Функция принимает одно число (int):
    #   side  :  одна из сторон квадрата

    # Возвращает периметр фигуры, а именно side умноженный на 4
    #   * Возвращаемое значение perimeter -> int

    # Пример вызова:
    # 1) side = 5 (входные данные)
    # 2) 5 * 4 = 20 (полученние возвращаемого значения функции)
    
    return 4 * side
