
def area(a):
    '''
    Возвращает площадь квадрата со сторонами длины а.

        Параметры:
             a (int/float): длина стороны квадрата

        Возвращаемое значение:
            a * a (int/float): площадь квадрата

    Пример вызова функции: area(5) = 25
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата со сторонами длины а.

        Параметры:
             a (int/float): длина стороны квадрата

        Возвращаемое значение:
            4 * a (int/float): периметр квадрата

    Пример вызова функции: perimeter(5) = 20
    '''
    return 4 * a
