def area(a):
    ''' возвращает площадь квадрата

                Параметры:
                      a (int) - длина сторон фигуры

                Возвращаемое значение:
                      произведение 2-х сторон квадрата
                                         (т.е. площадь) '''
    return a * a

def perimeter(a):
    ''' возвращает периметр квадрата

                Параметры:
                      a (int) - длина первой стороны квадрата

                Возвращаемое значение:
                      сумма всех сторон квадарата
                                        (т.е. периметр) '''
    return 4 * a

