
def area(a):
    """Принимает ребро квадрата и возвращает его площадь.

            Параметры:
                a (float, int): длинна ребера

            Возвращаемое значение:
                area (float, int): площадь квадрата со сторонами a
    """
    return a * a


def perimeter(a):
    """Принимает ребро квадрата и возвращает его периметр.

            Параметры:
                a (float, int): длинна ребра

            Возвращаемое значение:
                perimeter (float, int): периметр квадрата со сторонами a
    """
    return 4 * a
