def area(a):
    '''
    Рассчитывает площадь квадрата.

            Пример вызова:
                    area(2)  # Возвращает площадь квадрата со стороной 2.

            Параметры:
                    a (float): длина стороны квадрата.

            Возвращаемое значение:
                    a * a (float): Площадь квадрата.
    '''
    return a * a


def perimeter(a):
    '''
    Рассчитывает периметр квадрата.

            Пример вызова:
                    area(2)  # Возвращает периметр квадрата со стороной 2.

            Параметры:
                    a (float): длина стороны квадрата.

            Возвращаемое значение:
                    4 * a (float): Периметр квадрата.
    '''
    return 4 * a
