def area(a, b):
    '''
    Фунция расчитывает площадь треугольника.
    На вход поступает 2 значения:
                    a (int): целое число, равное длине одной стороны треугольника
                    b (int): целое число, равное длине другой стороны треугольника
                Функция выводит произведение 2 чисел делённое на 2.
    '''
    return a * b / 2
def perimetr(a, b, c):
    '''
    Фунция расчитывает периметр треугольника.
    На вход поступает 2 значения:
                    a (int): целое число, равное длине одной стороны треугольника
                    b (int): целое число, равное длине другой стороны треугольника
                    c (int): целое число, равное длине третьей стороны треугольника
                Функция выводит сумму 3 чисел.
    '''
    return a + b + c