def area(a, h): 
    '''
    Рассчитывает площадь треугольника.
            Параметры:
                    a (float): длина основания треугольника.
                    h (float): длина высоты треугольника, опушенной к основанию.

            Возвращаемое значение:
                    a * h / 2 (float): площадь треугольника.
    '''
    return a * h / 2 

def perimeter(a, b, c): 
    '''
    Рассчитывает периметр треугольника.
            Параметры:
                    a (float): длина первой стороны треугольника.
                    b (float): длина второй стороны треугольника.
                    c (float): длина третьей стороны треугольника.

            Возвращаемое значение:
                    a + b + c (float): периметр треугольника.
    '''
    return a + b + c 