def area(a, h): 
<<<<<<< HEAD
    ''' 
    Возвращает площадь треугольника.
        
        Принимает: 
            a (int): первое десятичное число в 10 система счисления, длина основания
            h (int): второе десятичное число в 10 система счисления, длина высоты
        Возвращаемое значение:
            Площадь треугольника

    '''
    return a * h / 2 

def perimeter(a, b, c): 
    ''' Принимает числа a, b и c, выозвращает их сумму '''
    return a + b + c
=======
    return a * h / 2 

def perimeter(a, b, c): 
    return a + b + c 

  
>>>>>>> 8009d4001bdef006a2d2a64cf4c5216cec252867
