def area(a, h):
    return a * h / 2
'''
Функция нахождения площади треугольника, принимает длину стороны и высоты, возвращает значение площади
    Параметры:
        a (int): длина стороны, целое число
        h (int): высота треугольника, целое число
    Возвращаемое значение:
        a * h / 2: площадь треугольника, вещественное число
'''

def perimeter(a, b, c):      #Функция нахождения периметра треугольника, принимает длину двух катетов и гипотенузы трекгольника, возвращает значение периметра
    return a + b + c
'''
Функция нахождения периметра треугольника, принимает длину трёх сторон, возвращает значение периметра
    Параметры:
        a (int): длина стороны, целое число
        b (int): длина стороны, целое число
        c (int): длина стороны, целое число
    Возвращаемое значение:
        a + b + c: периметр треугольника, целое число
'''