
def area(a, h):
    """ Возвращает площадь треугольника.
                       Параметры:
                            a (int) : сторона треугольника
                            h (int) : высота треугольника, проведенная к стороне a
                       Возвращаемое значение:
                           (a*h)/2 (int) : значение площади треугольника"""
    return a * h / 2 

def perimeter(a, b, c):
    """ Возвращает периметр треугольника.
                           Параметры:
                                a, b, c (int) : стороны треугольника
                           Возвращаемое значение:
                               a+b+c (int) : значение площади треугольника"""
    return a + b + c 
