def area(a, h): 
    return a * h / 2
    '''
        Возвращает площадь треугольника.
            Параметры: 
                a, h (int): Сторона и высота треугольника.

            Возвращаемое значение: 
                (a * h / 2): Площадь треугольника.
    '''

def perimeter(a, b, c): 
    return a + b + c
    '''
        Возвращает периметр треугольника.
            Параметры: 
                a, b, c (int): Стороны треугольника.

            Возвращаемое значение: 
                (a + b + c): Периметр треугольника.
    '''

