def area(a, h):
    # Вычисление площади треугольника

    # Входные данные: a (float), h (float) - сторона треугольника и высота, падающая на соответствующую сторону треугольника
    # Выходные данные: Площадь треугольника
    return a * h / 2 

def perimeter(a, b, c):
    # Вычисление периметра треугольника

    # Входные данные: a (float), h (float) - сторона треугольника и высота, падающая на соответствующую сторону треугольника
    # Выходные данные: Периметр треугольника 
    return a + b + c 