def area(a, h):
    
    '''
        Возвращаем площадь треугольника по заданной стороне и высоте.

            Параметры:
                a, h (int): Сторона и высота треугольника.

            Возвращаемое значение:
                area (int): Площадь треугольника.
                '''
    
    return a * h / 2

def perimeter(a, b, c):
    
    '''
            Возвращаем периметр треугольника по заданным сторонам.

                Параметры:
                    a, b, c (int): Стороны треугольника.

                Возвращаемое значение:
                    perimeter (int): Периметр треугольника.
                    '''
    
    return a + b + c

