def area(a, b):
	'''
	Возвращает площадь прямоугольника.

		Параметры:
			a (float): длина прямоугольника
			b (float): ширина прямоугольника

		Возвращаемое значение:
			area(a, b): площадь прямоугольника

		Пример вызова:
			area(3.0, 4.0) # 12.0
	'''
	return a * b


def perimeter(a, b):
	'''
	Возвращает периметр прямоугольника.

		Параметры:
			a (float): длина прямоугольника
			b (float): ширина прямоугольника

		Возвращаемое значение:
			perimeter(a, b): периметр прямоугольника

		Пример вызова:
			perimeter(3.0, 4.0) # 14.0
	'''

	return 2 * a + 2 * b
