def area(a):
    '''
    Возвращает площадь квадрата.

        Параметры:
            a (float): длина стороны квадрата

        Возвращаемое значение:
            area(a): площадь квадрата

        Пример вызова:
            area(3.0) # 9.0
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата.

        Параметры:
            a (float): длина стороны квадрата

        Возвращаемое значение:
            perimeter(a): периметр квадрата

        Пример вызова:
            perimeter(3.0) # 12.0
    '''
    return 4 * a
